NOTE:
-----

Please run the below cells first before proceeding- you'll need them soon!

In [1]:
%load_ext sql
%sql sqlite:///dataset_1.db

Activity 3-3
------------
Quantifiers, NULLs, and Outer Joins

Exercise #1
-----------

Recall that the tables we just looked at:

`bagel`, which describes types of bagels made by the different bagel companies:
> * name STRING
> * price FLOAT
> * made_by STRING

And `purchase`:
> * bagel_name STRING
> * franchise STRING
> * date INT
> * quantity INT
> * purchaser_age INT

Where `purchase.bagel_name` references `bagel.name` and `purchase.franchise` references `bagel.made_by`.

**Can you find out if there were any purchases of products not on one of the company's official lists (i.e. the `bagel` table), using a single SQL query?**

Write your query here:

In [2]:
%%sql
SELECT *
FROM purchase p
LEFT OUTER JOIN bagel b
     ON b.name = p.bagel_name AND b.made_by = p.franchise
WHERE b.name IS NULL;

 * sqlite:///dataset_1.db
Done.

[('Drugs', 'BAGEL CORP', 7, 1000, 37, None, None, None)]